Flinduino/flinduino-core/pic32/boards.txt
menu.USB=USB Devices

# Flinders Flinduino

Flinduino.name=Flinduino
Flinduino.group=Flinders

# new items
Flinduino.platform=pic32
Flinduino.build.board=_BOARD_FLINDUINO

Flinduino.usb.enabled=true
Flinduino.usb.default=a_cdcacm

Flinduino.ccflags=-Map="map.map"
Flinduino.ldscript=chipKIT-application-32MX250F128.ld
# Use this -G1024 option ONLY for boards with 64K RAM or less
Flinduino.compiler.c.extra_flags=-G1024
Flinduino.compiler.cpp.extra_flags=-G1024
# end of new items

Flinduino.upload.protocol=stk500v2
# 128KB - 4K for EEPROM - 4K for bootloader
Flinduino.upload.maximum_size=122880
Flinduino.upload.maximum_data_size=32768
Flinduino.upload.speed=115200
Flinduino.upload.tool=pic32prog

Flinduino.build.mcu=32MX250F128D
Flinduino.build.f_cpu=40000000L
Flinduino.build.core=pic32
Flinduino.build.variant=Flinduino

Flinduino.vid.0=0x04D8
Flinduino.pid.0=0xE9E1


Flinduino.menu.USB.a_cdcacm=Serial
Flinduino.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
Flinduino.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
Flinduino.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
Flinduino.menu.USB.z_custom=Custom / Disabled
Flinduino.menu.USB.z_custom.build.extra_flags=

